Autodesk.Revit.DB.ElementLevelFilter.LevelId
The id of the level that will be matched to elements' associated level.
Since:
2011

Autodesk.Revit.DB.ElementLevelFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id.
levelId:
The id of the level that will be matched to elements' associated level.
inverted:
True if the filter should match all elements not associated to the given level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementLevelFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of an ElementLevelFilter.
levelId:
The id of the level that will be matched to elements' associated level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementLevelFilter
A filter used to match elements by their associated level.
Remarks:
This filter is a slow filter.
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
Since:
2011